QA/load_test.yml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 1.66  # 100 users over 60 seconds (1.66 arrivals per second)
      name: "Baseline Load Test - 100 Users in 1 Minute"

scenarios:
  - name: "Standard User Flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/track"
      - think: 2
      - get:
          url: "/analytics"